In [15]:
import numpy as np
import pandas as pd

In [16]:
#creation from dict
cont = {"label":[1,1,3,3],
        "content":["one", "some sentence", "more words", "and so on"] } 
df1=pd.DataFrame(cont)
df1

   label        content
0      1            one
1      1  some sentence
2      3     more words
3      3      and so on

In [17]:
#creation from list
mini_array= [[1,2,3],   
             [4,8,6],
             [7,5,9],
             [7,5,99]]
df2=pd.DataFrame(mini_array, index= [42,43,44,45], columns= ["A","B","C"])
df2

    A  B   C
42  1  2   3
43  4  8   6
44  7  5   9
45  7  5  99

In [18]:
def square(x):
    return x**2
df2["C"]=df2["C"].apply(square)
df2

    A  B     C
42  1  2     9
43  4  8    36
44  7  5    81
45  7  5  9801

In [19]:
df2=df2.drop("B",axis=1)
df2

    A     C
42  1     9
43  4    36
44  7    81
45  7  9801

In [20]:
df2=df2[(df2["A"] >3) & (df2["C"] < 1000)]
df2

    A   C
43  4  36
44  7  81

In [21]:
df2= df2.rename(columns={'A':'Down',"C":"Up"})
df2

    Down  Up
43     4  36
44     7  81

In [22]:
df3= pd.concat([df2,df2], axis=0)
df3

    Down  Up
43     4  36
44     7  81
43     4  36
44     7  81

In [23]:
df3["Middle"]= df3["Up"]-df3["Down"]
df3

    Down  Up  Middle
43     4  36      32
44     7  81      74
43     4  36      32
44     7  81      74

In [24]:
df3["Up"].value_counts()

81    2
36    2
Name: Up, dtype: int64

In [27]:
df3.astype({"Down":float, "Up":complex})

    Down                   Up  Middle
43   4.0  36.000000+0.000000j      32
44   7.0  81.000000+0.000000j      74
43   4.0  36.000000+0.000000j      32
44   7.0  81.000000+0.000000j      74

In [28]:
print(df2.to_latex(index= False))

\begin{tabular}{rr}
\toprule
 Down &  Up \\
\midrule
    4 &  36 \\
    7 &  81 \\
\bottomrule
\end{tabular}